Terraform plan for __dev__
<details>
<summary>Plan: 7 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.secret_mgr_service_account_iam[0] will be created
  + resource "google_project_iam_member" "secret_mgr_service_account_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ebo-dev-321910"
      + role    = "roles/secretmanager.admin"
    }

  # google_service_account.secret_mgr_service_account will be created
  + resource "google_service_account" "secret_mgr_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "Service account for core credentials service"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.secret_mgr_service_account will be created
  + resource "google_service_account_iam_member" "secret_mgr_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ebo-dev-321910.svc.id.goog[api-creds/api-credentials]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # kubernetes_namespace.gke_namespace_api_creds will be created
  + resource "kubernetes_namespace" "gke_namespace_api_creds" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "api-creds"
            }
          + generation       = (known after apply)
          + labels           = {
              + "project" = "ebo-dev"
            }
          + name             = "api-creds"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.secret_mgr_service_account will be created
  + resource "kubernetes_service_account" "secret_mgr_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "api-credentials"
          + namespace        = "api-creds"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.payment_ticket_events_push.google_pubsub_subscription.push_subscriptions[0] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-refund-ticket-events-subscription"
      + path                       = (known after apply)
      + project                    = "ebo-dev-321910"
      + topic                      = "payment-refund-ticket-events"

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-dev.ibo.com/payment/v1/payment-refund/ticket-event"
        }
    }

  # module.payment_ticket_events_push.google_pubsub_subscription_iam_member.push_subscription_binding[0] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-refund-ticket-events-subscription"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #369](https://github.com/ebomart/commerce-infrastructure/actions/runs/1625914207)